[
  {
    "title": "TALK: Evolution of Web as a Platform",
    "publishedDate": "2018-09-06",
    "url": "https://www.youtube.com/watch?v=UGlC6ICR5Bg",
    "blurb": "A brief history of how web went from a tool for displaying pages to a platform for building applications, and what's next.",
    "type": "video",
    "image": "http://i3.ytimg.com/vi/UGlC6ICR5Bg/maxresdefault.jpg"
  },
  {
    "title": "Date-ing JavaScript",
    "publishedDate": "2018-06-18",
    "url": "https://dev.to/squgeim/date-ing-javascript-30k2",
    "blurb": "There have been some gotchas with working with Date in JavaScript that we’ve had to learn the hard way around. I’m hoping to blow your brains in a controlled manner now instead of having it blown later by a nasty bug."
  },
  {
    "title": "Regrets in a 10-month-old React Project",
    "publishedDate": "2018-03-27",
    "url": "https://dev.to/squgeim/regrets-in-a-1-year-old-react-project-4j7j",
    "blurb": "The JavaScript ecosystem has become scary. There are over 600,000 packages in NPM to choose from, with over 600 added every day, and the “best practices” are challenged and replaced by the hot new thing at an alarming rate. It is natural to want to avoid jumping on every new thing and choose what is needed when starting a new project. That is what we did when we started out on a project. These are the things we regret doing or not-doing from the get-go."
  },
  {
    "title": "Unit Testing Recompose HOCs",
    "publishedDate": "2018-01-08",
    "url": "https://dev.to/squgeim/unit-testing-recompose-hocs-3nh4",
    "blurb": "I am a huge fan of recompose. It lets us write pure, functional, “dumb” components, by allowing us to dump all the logic inside any of the huge collection of HOCs it provides. It’s awesome. I’ve been using this a lot and there’s this thing that has always been bugging me: how do you test them, *properly*?"
  },
  {
    "title": "Youtube Ad Auto-Skipper",
    "publishedDate": "2017-05-04",
    "url": "https://blog.lftechnology.com/youtube-ad-auto-skipper-ea52d4b2f202",
    "blurb": "“yt ad auto-skipper” is a very *very* simple browser extension that does nothing more than what its name suggests. If the video you are watching has a skippable ad, that ad will be skipped as soon as youtube allows you the option."
  },
  {
    "title": "Distro Dilemma of a Linux Nerd",
    "publishedDate": "2015-05-25",
    "url": "http://squgeim.blogspot.com/2015/05/distro-dillema-of-linux-nerd.html",
    "blurb": "I first saw a linux distro when I was 12. It was a Red Hat that my cousin had brought to install on my desktop (because he was too scared to do it in his own computer). He installed it using five CDs while I watched Anaconda do it's job. When the computer finally booted, we came to know that the whole of my 40GB hard disk had been wiped."
  },
  {
    "title": "squRemote",
    "publishedDate": "2013-12-22",
    "url": "http://squgeim.blogspot.com/2013/12/squremote.html",
    "blurb": "squRemote is a small utility that lets you control the media playing on your computer from you phone. It currently supports Android phone, and Linux and Windows PCs."
  },
  {
    "title": "Real Easy Way To Transfer Files From Linux",
    "publishedDate": "2013-10-27",
    "url": "http://squgeim.blogspot.com/2013/10/real-easy-way-to-transfer-files-from.html",
    "blurb": "Windows has Homegroups that make transferring files on a network real easy. This had me wondering: what do we Linux users have when we need to send a huge file to another computer really quick?"
  }
]
